<script setup>
import SimpleHeader from '@/components/SimpleHeader.vue';
import SimpleFooter from '@/components/SimpleFooter.vue';
</script>

<template>
  <SimpleHeader/>
  <main>
    <div class="container">
      <h1 class="content__title">Политика обработки персональных данных</h1>
      <ol>
        <li>
          Общие положения
          <ol>
            <li>
              Администратор сайта Профацкий М.А. (далее по тексту – Оператор) ставит соблюдение прав и свобод граждан одним из важнейших условий осуществления своей деятельности.
            </li>
            <li>
              Политика Оператора в отношении обработки персональных данных (далее по тексту — Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта freebots.ru. Персональные данные обрабатывается в соответствии с ФЗ «О персональных данных» № 152-ФЗ.
            </li>
          </ol>
        </li>
        <li>
          Основные понятия, используемые в Политике:
          <ol>
            <li>
              Веб-сайт - совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу freebots.ru;
            </li>
            <li>
              Пользователь – любой посетитель веб-сайта freebots.ru;
            </li>
            <li>
              Персональные данные – любая информация, относящаяся к Пользователю веб-сайта freebots.ru;
            </li>
            <li>
              Обработка персональных данных - любое действие с персональными данными, совершаемые с использованием ЭВМ, равно как и без их использования;
            </li>
            <li>
              Обезличивание персональных данных – действия, результатом которых является невозможность без использования дополнительной информации определить принадлежность персональных данных конкретному Пользователю или лицу;
            </li>
            <li>
              Распространение персональных данных – любые действия, результатом которых является раскрытие персональных данных неопределенному кругу лиц;
            </li>
            <li>
              Предоставление персональных данных – любые действия, результатом которых является раскрытие персональных данных определенному кругу лиц;
            </li>
            <li>
              Уничтожение персональных данных – любые действия, результатом которых является безвозвратное уничтожение персональных на ЭВМ или любых других носителях.
            </li>
          </ol>
        </li>
        <li>
          Оператор может обрабатывать следующие персональные данные Пользователя:
          <ol>
            <li>
              Список персональных данных, которые обрабатывает оператор: адрес электронной почты.
            </li>
            <li>
              Кроме того, на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики (Яндекс Метрика, Гугл Аналитика и других).
            </li>
          </ol>
        </li>
        <li>
          Цели обработки персональных данных
          <ol>
            <li>
              Персональные данные пользователя - адрес электронной почты - обрабатываются со следующей целью: подтверждение регистрации, почтовая рассылка новостей. Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений, направив Оператору письмо на адрес profatsky@gmail.com
            </li>
            <li>
              Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.
            </li>
          </ol>
        </li>
        <li>
          Правовые основания обработки персональных данных
          <ol>
            <li>
              Оператор обрабатывает персональные данные Пользователя только в случае их отправки Пользователем через формы, расположенные на веб-сайте freebots.ru. Отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.
            </li>
            <li>
              Оператор обрабатывает обезличенные данные о Пользователе в случае, если Пользователь разрешил это в настройках браузера (включено сохранение файлов «cookie» и использование технологии JavaScript).
            </li>
          </ol>
        </li>
        <li>
          Порядок сбора, хранения, передачи и других видов обработки персональных данных
          <ol>
            <li>
              Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.
            </li>
            <li>
              Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства.
            </li>
            <li>
              В случае выявления неточностей в персональных данных, Пользователь может актуализировать их, направив Оператору уведомление с помощью электронной почты на электронный адрес Оператора profatsky@gmail.com, с пометкой «Актуализация персональных данных».
            </li>
            <li>
              Срок обработки персональных данных является неограниченным. Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление с помощью электронной почты на электронный адрес Оператора profatsky@gmail.com, с пометкой «Отзыв согласия на обработку персональных данных».
            </li>
          </ol>
        </li>
        <li>
          Заключительные положения
          <ol>
            <li>
              Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты profatsky@gmail.com.
            </li>
            <li>
              В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. В случае существенных изменений Пользователю может быть выслана информация на указанный им электронный адрес.
            </li>
          </ol>
        </li>
      </ol>
    </div>
  </main>
  <SimpleFooter/>
</template>

<style scoped>
main {
  margin-bottom: 56px;
}

.content__title {
  margin: 18px 0px 36px 0px;
}

ol {
  list-style: none;
  counter-reset: num;
}

ol > li {
	counter-increment: num;
  font-size: 20px;
  font-weight: 600;
  margin-top: 24px;
}

ol > li::before {
	content: counter(num);
  font-weight: 600;
}

ol ol {
	counter-reset: num2;
  color: var(--body-text);
}

ol ol > li {
	counter-increment: num2;
  font-size: 16px;
  font-weight: 400;
  margin-top: 12px;
}

ol ol > li::before {
	content: counter(num) '.' counter(num2);
  font-weight: 400;
}


@media (min-width: 768px) and (max-width: 1169px) {
  main {
    margin-bottom: 48px;
  }

  .content__title {
    margin: 16px 0px 32px 0px;
    font-size: 28px;
  }
}

@media (max-width: 767px) { 
  main {
    margin-bottom: 36px;
  }
  
  .content__title {
    margin: 12px 0px 24px 0px;
    font-size: 20px;
  }

  ol > li {
    font-size: 16px;
    margin-top: 20px;
  }

  ol ol > li {
    font-size: 12px;
    margin-top: 8px;
  }
}
</style>